<body bgcolor=#FFFFFF link=#660000 vlink=#330000 alink=#840084 text=#000000>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>1.4.5. El proceso de diseño</B></FONT><BR>
<html>
<head>
<TITLE>El proceso de diseño</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">

<p class="titulo1">Principios del diseño de Interfaces</p>

<p class="titulo2">El proceso de dise&ntilde;o</p>

<p class="cuerpo"> El dise&ntilde;o de la interfaz sigue el proceso en cascada 
  para sistemas interactivos conocido en Ingenier&iacute;a del Software</p>
<p class="cuerpo"><img src="/106_80514/Contenidos/dis/../imagenes/dis/cdvida1.jpg" width="748" height="459"></p>
<p class="cuerpo"></p>
<p class="cuerpo">De modo simplificado, se sigue un proceso iterativo con refinamientos progresivos, 
  hasta que la evaluaci&oacute;n de la interfaz (del sistema) es positiva.<br>
</p>
<p align="center"><img src="/106_80514/Contenidos/dis/../imagenes/dis/cdvida2.jpg" width="341" height="240"></p>
<p class="cuerpo">El dise&ntilde;o se basa en la utilizaci&oacute;n de prototipos que ser&aacute;n 
  progresivamente refinados.<br>
</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/dis/../imagenes/dis/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>1.4.6. Guías y estándares</B></FONT><BR>
<html>
<head>
<TITLE>Guías y estándares</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="titulo1">Principios del diseño de Interfaces</p>
<p class="titulo2">Gu&iacute;as y est&aacute;ndares</p>
<p class="cuerpo">El dise&ntilde;o de la interfaz puede (y debe) apoyarse en gu&iacute;as 
  y est&aacute;ndares para asegurar su fiabilidad y facilidad de utilizaci&oacute;n.<br>
</p>
<p class="titulo3"> Guías de diseño<br>
</p>
<p>Los fabricantes de S.O. con interfaces gr&aacute;ficas de usuario (Microsoft, 
  Apple, Sun, etc) han publicado sus respectivas gu&iacute;as de dise&ntilde;o, 
  cuyo seguimiento facilita la coherencia entre interfaces de diferentes aplicaciones.</p>
<p>Diferentes instituciones y organismos nacionales tienen sus propias gu&iacute;as 
  de dise&ntilde;o, cuyo seguimiento se exige en ocasiones.<br>
</p>
<p class="titulo3">Normativa estándar UNE-EN-ISO</p>
<p><b>Normas</b>: </p>
<ul>
  <li>Documentos p&uacute;blicos que contienen especificaciones t&eacute;cnicas 
    <br>
  </li>
  <li> Aplicaci&oacute;n voluntaria<br>
  </li>
  <li> Basadas en la experiencia y el desarrollo tecnol&oacute;gico <br>
  </li>
  <li> Aceptadas por consenso de las partes interesadas. </li>
</ul>
<p><b>Ambito</b>:</p>
<ul>
  <li>Gran diversidad de productos o servicios</li>
  <li>Se incluyen los procesos de elaboraci&oacute;n: M&eacute;todos, calidad, 
    etc.</li>
</ul>
<p>
  <b>Prop&oacute;sito:</b></p>
<ul>
  <li>Definir un lenguaje com&uacute;n de comunicaci&oacute;n entre las partes</li>
</ul>
<p><b>Certificaci&oacute;n de cumplimiento de una norma o grupo de normas: </b><br>
</p>
<ul>
  <li>Emitida por entidades reconocidas de certificaci&oacute;n (ej. AENOR)<br>
  </li>
  <li>Se debe pasar un proceso de auditor&iacute;a <br>
  </li>
  <li>Adopci&oacute;n previa de <br>
    <ul>
      <li>Las especificaciones t&eacute;cnicas que la(s) norma(s) indica(n)<br>
      </li>
      <li>Los procesos para la comprobaci&oacute;n de su cumplimiento.</li>
    </ul>
  </li>
</ul>
<p><b>Normativa UNE-EN-ISO* aplicable al dise&ntilde;o, producci&oacute;n y mantenimiento 
  de interfaces de usuario:</b></p>
<ul>
  <li>UNE-EN ISO 9241: Requisitos ergon&oacute;micos para trabajos de oficina 
    con pantallas de visualizaci&oacute;n de datos (PVD).</li>
  <li>UNE-EN ISO 13407: Procesos de dise&ntilde;o para sistemas interactivos centrados 
    en operador humano.</li>
  <li>ISO 14915 Multimedia User Interface Design - Ergonomic Requirements for 
    human-centred multimedia (en preparaci&oacute;n) </li>
</ul>
<p>* <i>La normativa desarrollada por ISO y aceptada a nivel internacional se 
  traduce y transpone a la reglamentaci&oacute;n de cada pa&iacute;s, en particular 
  a la de la Uni&oacute;n Europea (EN) y a su vez a la espa&ntilde;ola (UNE)</i></p>
<p><i><br>
  </i><b>La norma UNE-EN ISO 9241: Requisitos ergon&oacute;micos para trabajos 
  de oficina con pantallas de visualizaci&oacute;n de datos (PVD).</b></p>
<p>Tiene 17 partes.</p>
<ul>
  <li>1 a 9 Requisitos para los dispositivos de entrada (soporte f&iacute;sico)</li>
  <li>10.- Principios de di&aacute;logo </li>
  <li>11.- Gu&iacute;a sobre utilizabilidad </li>
  <li>12.- Presentaci&oacute;n de la informaci&oacute;n </li>
  <li>13.- Gu&iacute;a del usuario </li>
  <li>14.- Di&aacute;logos mediante men&uacute;s</li>
  <li>15.- Di&aacute;logos mediante &oacute;rdenes</li>
  <li>16.- Di&aacute;logos mediante manipulaci&oacute;n directa</li>
  <li>17.- Di&aacute;logos mediante cumplimentaci&oacute;n de formularios</li>
</ul>
<p>En cada una se adjunta un ejemplo de formulario, que debe adaptarse a la aplicaci&oacute;n 
  espec&iacute;fica y que cubre todos los requisitos.<br>
</p>
<p><b>La norma UNE-EN ISO 13407: Procesos de dise&ntilde;o para sistemas interactivos 
  centrados en operador humano</b></p>
<p>Pensada para ser utilizada por los directores de proyecto, es complementaria 
  con la ISO 9241.</p>
<p>
  Contenido: </p>
<ul>
  <li>Definiciones terminol&oacute;gicas, justificaci&oacute;n de la importancia, 
    principios generales y planificaci&oacute;n del proceso de dise&ntilde;o centrado 
    en el usuario</li>
  <li>Actividades a realizar durante el desarrollo del proyecto: 
    <ul>
      <li>Entender y especificar el contexto de la utilizaci&oacute;n</li>
      <li>Especificar los requisitos del usuario y de su contexto </li>
      <li>Producir soluciones de dise&ntilde;o</li>
      <li>Evaluar los dise&ntilde;os a partir de los requisitos.</li>
    </ul>
  </li>
  <li>Ejemplo de procedimiento (cinco tablas de tipo checkbox). </li>
  <li>Anexos 
    <ul>
      <li>Gu&iacute;a de otras normas relevantes </li>
      <li>Ejemplo de estructura de informe de evaluaci&oacute;n de la usabilidad.<br>
      </li>
    </ul>
    
  </li>
</ul>
<p><b>La norma ISO 14915: Multimedia User Interface Design - Ergonomic Requirements 
  for human-centred multimedia</b></p>
<p><br>
  Todav&iacute;a en fases iniciales de desarrollo.</p>
<p>Contenido:</p>
<ul>
  <li>Introducci&oacute;n y generalidades</li>
  <li>Control y navegaci&oacute;n en aplicaciones multimedia</li>
  <li>Selecci&oacute;n de medios y combinaci&oacute;n de medios</li>
  <li>Interfaces de dominio espec&iacute;fico<br>
  </li>
</ul>
<p><br>
</p>
<p></p>
<table width=750 border=0 align="center">
  <tr> 
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/dis/../imagenes/dis/separador.gif"></td>
  </tr>
  <tr> 
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>1.4.7. Metodologías de análisis y diseño</B></FONT><BR>
<html>
<head>
<TITLE>Metodologías de análisis y diseño</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">

<p class="titulo1">Principios del diseño de Interfaces</p>

<p class="titulo2">Metodolog&iacute;as de an&aacute;lisis y dise&ntilde;o</p>

<p class="cuerpo"> La normas sistematizan los procedimientos de an&aacute;lisis, 
  dise&ntilde;o y evaluaci&oacute;n de las interfaces, pero no especifican la 
  metodolog&iacute;a aplicable, que debe ser predefinida por el desarrollador 
  y especificada en la documentaci&oacute;n. </p>
<p class="cuerpo">No existe una metodolog&iacute;a de desarrollo unificada o recomendada. La 
  mayor parte de las estudiadas en Ingenier&iacute;a del Software pueden ser aplicadas 
  a alguna de las fases.</p>
<p class="cuerpo">En este curso se citan parte de los m&eacute;todos o modelos existentes, desarrollando 
  alguno de ellos. Finalmente se propone un m&eacute;todo simplificado para el 
  desarrollo y evaluaci&oacute;n de interfaces simples.</p>
<p class="cuerpo">Todas las t&eacute;cnicas se basan en la generaci&oacute;n de prototipos, que 
  en las etapas iniciales se formulan y representan &#147;sobre papel&#148; (LowFi), 
  se refinan hasta donde sea necesario y finalmente se implementan e integran 
  en el sistema (HiFi).<br>
</p>
<p class="titulo3">Análisis: características de los usuarios y de su entorno</p>
<p class="cuerpo"></p>
<p class="cuerpo">Siguiendo el texto de Dix, los modelos del usuario se clasifican 
  de la siguiente forma:</p>
<p class="cuerpo"><b>1. Modelos socio-t&eacute;cnicos</b></p>
<p class="cuerpo">Tratan de identificar los requerimientos humanos, sociales, organizacionales 
  y t&eacute;cnicos. <br>
  Ejemplos: USTM/CUSTOM, OSTA y ETHICS.</p>
<p class="cuerpo"><b>2. Metodolog&iacute;a de Soft Systems (SSM)</b></p>
<p class="cuerpo">Este m&eacute;todo considera a los operadores y a la tecnolog&iacute;a como 
  partes del sistema completo, y ayuda al dise&ntilde;ador a comprender la situaci&oacute;n 
  m&aacute;s que a hallar una soluci&oacute;n.<br>
  Tiene siete etapas, en las que se van identificando y refinando los actores 
  y sus tareas en etapas en el mundo real (1-2, 5-7) y etapas de sistemas (3-4).</p>
<p class="cuerpo"><b>3. Dise&ntilde;o participativo</b></p>
<p class="cuerpo">Cubre todo el ciclo de vida, e integra a los usuarios dentro del equipo de 
  dise&ntilde;o; no excluye a los otros m&eacute;todos.</p>
<p class="cuerpo">Muy recomendable, ya que permite detectar las necesidades y evaluar los resultados 
  desdelas fases muy tempranas del desarrollo.</p>
<p class="cuerpo">Para comunicar a los usuarios con los dise&ntilde;adores, se utilizan varios 
  m&eacute;todos:</p>
<ul class="cuerpo">
  <li>Tormenta de ideas (<i>brainstorming</i>)</li>
  <li>Elaboraci&oacute;n de guiones (<i>storyboarding</i>)</li>
  <li>Reuniones de trabajo (<i>workshops</i>) </li>
  <li>Ejercicios con l&aacute;piz y papel (dise&ntilde;o de bajo nivel).<br>
  </li>
</ul>
<p class="cuerpo"><b>4. Jerarqu&iacute;as de objetivos (goals) y tareas (task)</b></p>
<p class="cuerpo">Estos m&eacute;todos utilizan la descomposici&oacute;n de los objetivos en 
  subobjetivos a alcanzar (divide y vencer&aacute;s) que se alcanzan mediante 
  la ejecuci&oacute;n de tareas y/o subtareas.</p>
<p class="cuerpo">Ejemplos: </p>
<ul class="cuerpo">
  <li>GOMS (Goals, Operators, Methods and Selection) </li>
  <li>CCT (Cognitive Complexity Theory).</li>
</ul>
<p class="cuerpo"><b>5. Modelos ling&uuml;&iacute;sticos</b></p>
<p class="cuerpo">Adaptaciones de modelos usados para especificar lenguajes.</p>
<p class="cuerpo">Ejemplos:</p>
<ul class="cuerpo">
  <li>BNF (Backus-Naur Form)</li>
  <li>Task - Action Grammar.<br>
  </li>
</ul>
<p class="titulo3">An&aacute;lisis: caracter&iacute;sticas de los dispositivos<br>
 </p>
  
<b>El m&eacute;todo KLM</b> (<i>Keystroke Level Model</i>) permite efectuar predicciones 
detalladas del rendimiento de un operador a partir de la descripci&oacute;n de 
sus acciones motoras. 
<p class="cuerpo">La ejecuci&oacute;n de una tarea se descompone en secuencias de elementos, 
  que pueden ser:<br>
</p>
<ul class="cuerpo">
  <li>K -&gt; Pulsar una tecla<br>
  </li>
  <li>B -&gt; Pulsar un bot&oacute;n del rat&oacute;n<br>
  </li>
  <li>P -&gt; Apuntar o desplazar el rat&oacute;n a un blanco<br>
  </li>
  <li>H -&gt; Mover la mano del rat&oacute;n al teclado o viceversa<br>
  </li>
  <li>D -&gt; Dibujar l&iacute;neas con el rat&oacute;n<br>
  </li>
  <li>M -&gt; Prepararse mentalmente para una acci&oacute;n<br>
  </li>
  <li>R -&gt; Retardo debido al tiempo de respuesta del sistema</li>
</ul>
<p class="cuerpo">Como cada una de estas tareas tiene un tiempo medio asociado, se puede predecir 
  el tiempo de respuesta.<br>
</p>
<p class="titulo3">Análisis de tareas</p>
<p class="cuerpo"><b>El an&aacute;lisis de tareas </b>busca analizar la forma en la que las personas 
  efect&uacute;an un determinado trabajo. </p>
<p class="cuerpo">Seg&uacute;n Dix, existen tres aproximaciones: </p>
<ul class="cuerpo">
  <li>La descomposici&oacute;n de tareas. Se describe brevemente a continuaci&oacute;n</li>
  <li>Las t&eacute;cnicas basadas en el conocimiento </li>
  <li>El an&aacute;lisis basado en el modelo entidad-relaci&oacute;n, similar 
    a la utilizada en el dise&ntilde;o de bases de datos.</li>
</ul>
<p class="cuerpo">Estas t&eacute;cnicas se utilizan tanto para dise&ntilde;ar nuevos sistemas 
  como para editar maunales de usuario y otro tipo de documentaci&oacute;n.</p>
<p class="cuerpo">La informaci&oacute;n necesaria se extrae de la documentaci&oacute;n existente, 
  de la observaci&oacute;n de la forma en la que las personas efect&uacute;an 
  la tarea, de entrevistas, etc.</p>
<p class="titulo3">Análisis de tareas: descomposición de tareas </p>

<b>El an&aacute;lisis jer&aacute;rquico de tareas (HTA)</b> permite describir 
una tarea mediante dos tipos de elementos: 
<ul class="cuerpo">
  <li>La descomposici&oacute;n y ordenaci&oacute;n jer&aacute;rquica de subtareas 
  </li>
  <li>La planificaci&oacute;n, que describe qu&eacute; subtareas deben realizarse 
    y en qu&eacute; circunstancias.</li>
</ul>
<p class="cuerpo">El proceso puede proseguir mediante refinamientos progresivos hasta llegar 
  al grado de granularidad requerido, que en todo caso ser&aacute; mayor que el 
  obtenido mediante t&eacute;cnicas basadas en el conocimiento.<br>
</p>
<b>Ejemplo</b>: An&aacute;lisis de la tarea <i>regar el jard&iacute;n.</i> 
<p class="titulo3"> <img src="/106_80514/Contenidos/dis/../imagenes/dis/hta1.jpg" width="720" height="454"></p>
<p class="titulo3">An&aacute;lisis de di&aacute;logos. Notaciones.</p>
<p class="cuerpo"><b>Di&aacute;logo</b> es toda conversaci&oacute;n entre dos o m&aacute;s partes.</p>
<p class="cuerpo">En el dise&ntilde;o de interfaces, di&aacute;logo es la estructura de la conversaci&oacute;n 
  entre el computador y el usuario. Puede verse en tres niveles:</p>
<ul class="cuerpo">
  <li>Nivel l&eacute;xico: elementos b&aacute;sicos, p. ej. forma de los iconos, 
    pulsaci&oacute;n de una tecla, posicionamiento del cursor, click del rat&oacute;n, 
    ...</li>
  <li>Nivel sint&aacute;ctico: Estructura de las entradas y salidas, p. ej. (para 
    abrir un fichero) colocar puntero sobre archivo + click en archivo + click 
    en abrir ...</li>
  <li>Nivel sem&aacute;ntico: Efecto (sobre el sistema y sobre el mundo real) 
    de un di&aacute;logo.<br>
  </li>
</ul>

<p class="cuerpo">Se pueden utilizar diferentes notaciones para el dise&ntilde;o 
  de di&aacute;logos, que generalmente se basan en t&eacute;cnicas desarrolladas 
  para el dise&ntilde;o de sistemas.</p>
<p class="cuerpo">Existen dos grupos de notaciones: las basadas en diagramas y las textuales. 
</p>
<p class="cuerpo">Notaciones basadas en diagramas:</p>
<p class="cuerpo">Redes transici&oacute;n - estado (STN): utilizan diagramas constituidos por 
  c&iacute;rculos (estados) unidos por segmentos (transiciones) que enlazan los 
  estados. Con frecuencia se a&ntilde;aden otro tipo de s&iacute;mbolos para caracterizar 
  estados intermedios que deben desarrollarse con m&aacute;s detalle.<br>
</p>
<p class="cuerpo">Ejemplo:<br>
</p>
<p class="cuerpo"><img src="/106_80514/Contenidos/dis/../imagenes/dis/dialog1.jpg"> </p>
<p class="cuerpo">Tambi&eacute;n pueden utilizarse otras t&eacute;cnicas como los diagramas de 
  flujo, diagramas de dise&ntilde;o estructurado de Jackson (JSD), redes de Petri, 
  etc. </p>
<p class="titulo3">An&aacute;lisis de di&aacute;logos. Notaciones. Sem&aacute;ntica.</p>

<p class="cuerpo">Son notaciones textuales, tambi&eacute;n basadas en t&eacute;cnicas 
  usadas en Ingenier&iacute;a del Software.</p>
<p class="cuerpo">Ejemplos: </p>
<ul class="cuerpo">
  <li>Backus-Naur form (BNF)</li>
  <li>Reglas de producci&oacute;n dirigidas a eventos, estados o ambas</li>
  <li>Otros...</li>
</ul>
<p class="cuerpo">Una vez descrito el di&aacute;logo, se debe asociar a cada parte la sem&aacute;ntica 
  de cada acci&oacute;n, bien sobre el mismo esquema o en otro separado; el grado 
  de formalizaci&oacute;n depende de la complejidad y criticidad de la acci&oacute;n.</p>
<p class="cuerpo"><br>
</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/dis/../imagenes/dis/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>1.4.8. Metodologías de evaluación</B></FONT><BR>
<html>
<head>
<TITLE>Metodologías de evaluación</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">

<p class="titulo1">Principios del diseño de Interfaces</p>

<p class="titulo2">Metodolog&iacute;as de evaluaci&oacute;n</p>

<p class="cuerpo"> Una vez dise&ntilde;ado el interfaz, debe asegurarse su usabilidad 
  mediante t&eacute;cnicas de evaluaci&oacute;n.</p>
<p class="cuerpo">Estas t&eacute;cnicas se dividen en dos grupos, seg&uacute;n se basen o no 
  en la intervenci&oacute;n de los usuarios.</p>
<p class="cuerpo">Estas &uacute;ltimas son las m&aacute;s recomendables, ya que son m&aacute;s 
  realistas y motivan a los usuarios. No obstante, tambi&eacute;n son m&aacute;s 
  costosas y requieren un mayor esfuerzo y la participaci&oacute;n de un mayor 
  n&uacute;mero de personas.</p>
<p class="cuerpo">Habitualmente se utilizan t&eacute;cnicas mixtas, adaptadas a cada problema 
  o empresa.</p>

<p class="titulo3">Evaluaci&oacute;n.- T&eacute;cnicas sin intervenci&oacute;n 
  de los usuarios</p>
  
<p class="cuerpo"><b>Modelos predictivos </b></p>
<blockquote>
  <p class="cuerpo">Son modelos formales que recogen los resultados del análisis de tareas (procesos 
    mentales del usuario) y los comparan con las acciones necesarias para llevar 
    a cabo esa tarea. </p>
  <p class="cuerpo">En algunos casos permiten predecir ciertos parámetros, como el tiempo de 
    aprendizaje y la tasa de errores. </p>
</blockquote>
<p class="cuerpo"><b>Evaluación heurística </b></p>
<blockquote>
  <p class="cuerpo">Se basa en la revisión por parte de expertos que no han participado en el 
    diseño pero que conocen los principios de ergonomía y usabilidad. </p>
</blockquote>
<p class="cuerpo"><b>Ensayo (<i>walkthrough</i> )</b> </p>
<blockquote>
  <p class="cuerpo">Debe imitarse cada paso de los que realizar&iacute;a un usuario para llevar 
    a cabo una tarea de modo preciso y met&oacute;dico, incluyendo los de percepci&oacute;n 
    y los procesos mentales.</p>
  <p class="cuerpo">Para cada paso, se analiza la adecuaci&oacute;n de la interfaz.</p>
  <p class="cuerpo">Estos m&eacute;todos se apoyan en <b>cuestionarios</b>. </p>
  <p class="cuerpo"><b>Ejemplo</b>: T&eacute;cnicas de ensayo cognitivo (<i>cognitive walkthrough</i> 
    ).</p>
  <p class="cuerpo">Se necesita la siguiente informaci&oacute;n:</p>
  <ul class="cuerpo">
    <li> Descripci&oacute;n del prototipo del sistema, suficientemente detallada</li>
    <li>Descripci&oacute;n de la tarea a realizar</li>
    <li>Lista completa de acciones necesarias para realizar la tarea</li>
    <li>Descripci&oacute;n de la experiencia esperable de los usuarios</li>
  </ul>
  <p class="cuerpo">A partir de esta informaci&oacute;n, el equipo de evaluaci&oacute;n parte 
    de la lista de acciones anterior y contesta a las siguientes preguntas:<br>
  </p>
  <ul class="cuerpo">
    <li>&iquest;Conoce el usuario todos los efectos que la acci&oacute;n producir&aacute;?</li>
    <li>&iquest;Identificar&aacute; el usuario la disponibilidad de la acci&oacute;n 
      deseada?</li>
    <li>Una vez identificada, &iquest;sabe que es la adecuada para producir los 
      efectos deseados?</li>
    <li>Una vez realizada la tarea, &iquest;entiende el usuario la realimentaci&oacute;n 
      recibida? (respuesta del sistema) <br>
    </li>
  </ul>
</blockquote>
<p class="titulo3">Evaluaci&oacute;n.- T&eacute;cnicas con intervenci&oacute;n de los usuarios<br>
</p>

<p class="cuerpo"><b>Experimentos controlados </b></p>
<blockquote>
  <p class="cuerpo">Se plantean sobre una tarea o conjunto de tareas a diferentes niveles de 
    detalle. </p>
  <p class="cuerpo">A partir de una hipótesis (resultado esperado), se plantean varias alternativas 
    que aíslan una sola variable (p. ej. número de items del menú, significado 
    de un icono, ...)y se observa la respuesta del grupo de usuarios. </p>
  <p class="cuerpo">Este grupo debe ser escogido de modo que represente a los diferentes tipos 
    de usuarios. </p>
  <p class="cuerpo">Estos métodos requieren conocimientos de estadística y de diseño de experimentos 
    científicos. </p>
  <p class="cuerpo">Los resultados indican las diferencias entre las alternativas propuestas 
    y entre las respuestas de los diferentes grupos de usuarios. </p>
</blockquote>
<p class="cuerpo"><b>Monitorizaci&oacute;n</b></p>
<blockquote>
  <p class="cuerpo">Grabaci&oacute;n autom&aacute;tica de todas las acciones que desarrolla el 
    usuario, incluyendo cada pulsaci&oacute;n de una tecla (con errores), movimiento 
    del rat&oacute;n, etc..</p>
  <p class="cuerpo">Se aplica conjuntamente con otras t&eacute;cnicas, y s&oacute;lo cuando se 
    precisa informaci&oacute;n muy detallada.</p>
  <p class="cuerpo">La informaci&oacute;n recogida puede ser muy voluminosa y dif&iacute;cil 
    de tratar, por lo que hay que dise&ntilde;ar muy cuidadosamente la experiencia.</p>
  <p class="cuerpo">El programa de captura puede ralentizar los procesos, influyendo en los resultados.</p>
</blockquote>
<p class="cuerpo"><b>Cuestionarios</b></p>
<blockquote>
  <p class="cuerpo">Se formulan una serie de preguntas acerca de la tarea a evaluar, que ser&aacute;n 
    contestadas con valoraciones, p. ej. de 0 (nunca, muy deficiente, ...) a 5 
    (siempre, perfecto, ...)</p>
  <p class="cuerpo">Tambi&eacute;n se pueden dejar preguntas abiertas.</p>
  <p class="cuerpo">Los cuestionarios pueden prepararse, por ejemplo, a partir de los ejemplos 
    de procedimientos de evaluaci&oacute;n de la aplicabilidad y la adhesi&oacute;n 
    de las normas ISO 9241. Ver tambi&eacute;n los textos de Dix y Schneidermann 
    (Evaluaci&oacute;n)</p>
</blockquote>
<p class="cuerpo"><b>Entrevistas</b></p>
<blockquote>
  <p class="cuerpo">Se aplican m&eacute;todos similares al caso anterior; el sistema permite 
    una mayor flexibilidad pero es m&aacute;s costoso.<br>
  </p>
</blockquote>
<p class="cuerpo"><b>Observaci&oacute;n directa</b></p>
<blockquote>
  <p class="cuerpo">Se trata de seguir el comportamiento de los usuarios mientras trabajan.</p>
  <p class="cuerpo">Se prepara la sesi&oacute;n planteando la tarea concreta a resolver con un 
    conjunto de datos tambi&eacute;n concretos.</p>
  <p class="cuerpo">Se informa a los usuarios y se pide que formulen sus observaciones tal y 
    como aparecen.</p>
  <p class="cuerpo">Los grupos de usuarios deben ser cuidadosamente escogidos, y debe procurarse 
    no influir en ellos (dif&iacute;cil).<br>
  </p>
</blockquote>
<p class="cuerpo"><b>Evaluaci&oacute;n durante la explotaci&oacute;n comercial</b></p>
<blockquote>
  <p class="cuerpo">&Uacute;til para la detecci&oacute;n de errores residuales, la mejora de 
    la funcionalidad o la detecci&oacute;n de necesidades para futuras versiones.</p>
  <p class="cuerpo">T&eacute;cnicas:</p>
  <ul class="cuerpo">
    <li>Distribuci&oacute;n gratuita o a precio reducido de versiones beta o de 
      evaluaci&oacute;n</li>
    <li>Establecimiento de grupos de discusi&oacute;n o grupos de noticias. Entrevistas 
      retribuidas de alguna forma</li>
    <li>Servicio en l&iacute;nea o telef&oacute;nico de consulta o notificaci&oacute;n 
      de sugerencias <br>
    </li>
  </ul>
  <p class="cuerpo"><br>
  </p>
</blockquote>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/dis/../imagenes/dis/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>1.4.9. Ejemplo: un método sencillo</B></FONT><BR>
<html>
<head>
<TITLE>Ejemplo: un método sencillo</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">

<p class="titulo1">Principios del diseño de Interfaces</p>

<p class="titulo2">Ejemplo: un m&eacute;todo sencillo de dise&ntilde;o y evaluaci&oacute;n</p>

<p class="cuerpo"> Este m&eacute;todo tiene dos fases, que se apoyan en dos t&eacute;cnicas 
  diferentes:</p>
<p class="cuerpo"><b>1.- T&eacute;cnica de baja fidelidad (<i>Lo-fi technique</i>)</b></p>
<blockquote>
  <p class="cuerpo"> &Uacute;til en las fases iniciales<br>
    Sobre papel (Paper prototyping)</p>
</blockquote>
<p class="cuerpo"><b>2.- T&eacute;cnica de alta fidelidad (<i>Hi-Fi technique</i>)</b></p>
<blockquote> 
  <p class="cuerpo"> En fases avanzadas<br>
    A partir de resultados en papel, se dise&ntilde;a- implementa- eval&uacute;a 
    la interfaz<br>
    Ya sobre la m&aacute;quina y herramienta elegidas<br>
    Inicialmente con ninguna o poca funcionalidad<br>
    En fases sucesivas se va incorporando la funcionalidad definitiva<br>
  </p>
</blockquote>
<p class="cuerpo"> <b>&iquest;Por qu&eacute; es necesario el dise&ntilde;o Lo-Fi?</b></p>
<ul class="cuerpo">
  <li> Los prototipos Hi-Fi son muy costosos, en t&eacute;rminos de construcci&oacute;n 
    y modificaci&oacute;n</li>
  <li>Los revisores se centran en los detalles y no en las ideas centrales (este 
    bot&oacute;n m&aacute;s gordo&#133;)</li>
  <li>Los desarrolladores se resisten a los cambios (&iquest;Cambiar esto porque 
    lo dicen estos ignorantes?)</li>
  <li>Pueden crearse expectativas falsas (Esto est&aacute; casi acabado, esto 
    va r&aacute;pido&#133;)</li>
  <li>Los errores detienen todo el proceso<br>
  </li>
</ul>
<p class="titulo3">Construcci&oacute;n del prototipo</p>
  
<p class="cuerpo"><b>1.- Preparaci&oacute;n de equipo humano y obtenci&oacute;n del material</b></p>
<ul class="cuerpo">
  <li> Equipo humano de dise&ntilde;o</li>
  <li>Material de oficina:
    <ul class="cuerpo">
      <li>Papel de paqueter&iacute;a (grande), papel, etiquetas adhesivas, fichas 
        de cart&oacute;n, acetatos</li>
      <li>Material de escritura, tijeras, &#133;</li>
      <li>Pizarra, Fotocopiadora</li>
    </ul>
  </li>
</ul>
<p class="cuerpo"> <b>2.- Establecimiento del plan de trabajo</b><br>
  Se fijan las fechas l&iacute;mite para cada fase y las fechas de evaluaci&oacute;n 
  (con el cliente)</p>
<ul class="cuerpo">
  <li>Ayuda a tomar decisiones </li>
  <li>Lo m&aacute;s importante se decide antes</li>
  <li>El resto para la fase siguiente<br>
  </li>
</ul>
<p class="cuerpo"><b>3.- Construcci&oacute;n f&iacute;sica del prototipo</b><br>
  Modelo completo de la interfaz (al nivel que corresponde)</p>
<ul class="cuerpo">
  <li>&#147;Pantalla&#148; base, men&uacute;s desplegables, botones, texto, di&aacute;logos&#133;</li>
  <li>Fotocopias de lo que haga falta (correccciones, elementos repetidos,&#133;)</li>
  <li>Se pueden usar herramientas de dise&ntilde;o por computador, pero se pierde 
    tiempo.</li>
</ul>
<p class="cuerpo"><b>4.- Preparaci&oacute;n de la sesi&oacute;n de evaluaci&oacute;n</b></p>
<ul class="cuerpo">
  <li>Equipo: tres ($$!!) miembros del equipo de dise&ntilde;o, y usuarios</li>
  <li>Observador (toma notas)</li>
  <li>Gu&iacute;a (ayuda al usuario)</li>
  <li>&#147;Computador&#148; (maneja el modelo)</li>
  <li>Selecci&oacute;n de una muestra de los usuarios<br>
  </li>
</ul>
<p class="cuerpo"><b>5.- Desarrollo de la sesi&oacute;n de evaluaci&oacute;n</b><br>
  Tantas simulaciones como usuarios hayamos escogido.</p>
<ul class="cuerpo">
  <li> El observador toma notas (clave para el refinamiento posterior)</li>
  <li>El gu&iacute;a ayuda al usuario</li>
  <li>El &#147;computador&#148; maneja el modelo</li>
  <li>El usuario hace como que trabaja</li>
</ul>
<p class="cuerpo"><b>6.- Evaluaci&oacute;n de resultados</b></p>
<ul class="cuerpo">
  <li>Se ordenan las notas tomadas por el observador (por orden de importancia)</li>
  <li>Se corrige y actualiza el modelo</li>
  <li>Se decide la siguiente fase (volver a fase 1 o pasar a Alta fidelidad)<br>
  </li>
</ul>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/dis/../imagenes/dis/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/dis/../imagenes/dis/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>4.12.1. Entornos Virtuales</B></FONT><BR>
<html>
<head>
<title>Entornos Virtuales</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p><span class="titulo1">Entornos Virtuales</span><br>
</p>
<p class="cuerpo">Las siguientes tecnolog&iacute;as hacen posible la creaci&oacute;n 
  de <i>mundos virtuales de escritorio</i>, denominados as&iacute; porque permiten 
  al usuario sumergirse y explorar un espacio tridimensional desde su ordenador 
  con la &uacute;nica ayuda del rat&oacute;n.</p>
<p class="cuerpo">&nbsp;</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/rv/../imagenes/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>4.12.2. VRML</B></FONT><BR>
<html>
<head>
<title>VRML</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p><span class="titulo1">VRML - Virtual Reality Modeling Language</span></p>
<p class="cuerpo">Es un lenguaje con el que pueden definirse tanto el espacio 
  de coordenadas del mundo virtual, como los objetos tridimensionales y multimedia 
  que lo componen, los comportamientos de esos objetos y enlaces a otras aplicaciones. 
  Este lenguaje est&aacute; pensado para ser utilizado en entornos distribuidos 
  como la web, para lo cual hace posible que un mundo virtual se componga de varios 
  ficheros enlazados o incluidos, hace uso de est&aacute;ndares establecidos de 
  ISO e Internet para otros formatos de fichero y proporciona una sintaxis compacta. 
</p>
<p class="cuerpo">Para facilitar la tarea tarea de modelado existen algunas herramientas 
  que permiten dibujar los mundos tridimensionales de una forma m&aacute;s intuitiva, 
  tales como 3D Studio, y, posteriormente, traducirlos a una especificaci&oacute;n 
  VRML.</p>
<p class="cuerpo"> Para visualizar esta informaci&oacute;n a trav&eacute;s de 
  navegadores se pueden utilizar diversos visores como son <a href="http://www.sgi.com/software/cosmo">Cosmo 
  Player</a> o <a href="http://www.parallelgraphics.com/products/cortona">Cortona</a>.</p>
<p class="cuerpo">En internet se pueden encontrar numerosas fuentes de informaci&oacute;n 
  y tutoriales sobre este lenguaje. Algunos ejemplos son:</p>
<p class="cuerpo">- <a href="http://dmi.uib.es/%7Eabasolo/cursovrml/indice.htm">http://dmi.uib.es/%7Eabasolo/cursovrml/indice.htm</a> 
  :curso que ense&ntilde;a a construir mundos virtuales 3D en la Web mediante 
  el lenguaje est&aacute;ndar VRML 97.</p>
<p class="cuerpo">- <a href="http://www.web3d.org/vrml/vrml.htm">http://www.web3d.org/vrml/vrml.htm</a> 
  : Numerosos enlaces a tutoriales, libros, especificaciones oficiales y gran 
  cantidad de informaci&oacute;n sobre VRML y otras tecnolog&iacute;as. </p>
<p class="cuerpo">- <a href="http://www.sdsc.edu/siggraph96vrml/">http://www.sdsc.edu/siggraph96vrml/</a> 
  : curso sobre VRML 2.0 que <b>puede descargarse para consultarlo offline</b><br>
</p>

<p class="titulo2">&nbsp;</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/rv/../imagenes/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>4.12.3. QuickTime VR</B></FONT><BR>
<html>
<head>
<title>QuickTime VR</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="titulo1">QuickTime VR</p>
<p class="cuerpo"><a href="http://www.apple.com/quicktimelive/index.html">QuickTime 
  VR</a> es la propuesta de Apple para generar espacios trimidensionales. Con 
  este software, los dise&ntilde;adores pueden convertir de forma muy simple im&aacute;genes 
  bidimensionales en mundos virtuales con escenas tridimensionales y componentes 
  interactivos. </p>
<p class="cuerpo">Los mundos virtuales generados con esta herramienta pueden ser 
  utilizados en distintas plataformas y, de hecho, pueden verse con cualquiera 
  de las aplicaciones capaces de ejecutar pel&iacute;culas quicktime. No obstante, 
  y a diferencia de las dos otras opciones que se presentar&aacute;n a continuaci&oacute;n, 
  ni el software de creaci&oacute;n, como por ejemplo QuickTime VR Authoring Studio, 
  VR Worx 2.0 o Corel Photo&#150;Paint 8, ni la aplicaci&oacute;n generada son 
  independientes de la plataforma. </p>
<p class="cuerpo">En <a href="http://www.virtuallyvancouver.com">http://www.virtuallyvancouver.com</a> 
  se muestra un ejemplo de utilizaci&oacute;n de esta tecnolog&iacute;a para realizar 
  una visita virtual por la ciudad de Vancouver.</p>
<p class="titulo2">&nbsp;</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/rv/../imagenes/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
<FONT FACE="ARIAL, HELVETICA, SANS-SERIF"><B>4.12.4. Java 3D</B></FONT><BR>
<html>
<head>
<title>Java 3D</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="../estilos.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="titulo1">Java 3D </p>
<p class="cuerpo">La API de javaSoft denominada <a href="http://java.sun.com/products/java-media/3D/index.html">Java 
  3D</a> pertenece a un conjunto de APIs que han sido desarrolladas con el fin 
  de ofrecer un entorno en que incluir en las p&aacute;ginas web todo tipo de 
  informaci&oacute;n multimedia. JAVA 3D presenta dos ventajas fundamentales: 
  al igual que ocurr&iacute;a con VRML, es independiente de plataforma de manera 
  que el dise&ntilde;ador puede aprovecharse del hecho de escribir un &uacute;nico 
  c&oacute;digo ejecutable en cualquier sitio; y, adem&aacute;s, al contrario 
  que QuickTime VR o VRML no requiere que el usuario instale un plug&#150;in en 
  su navegador web para utilizar el mundo virtual.</p>
<p class="cuerpo">Esta API se puede utilizar para crear aplicaciones tridimensionales 
  o applets 3D para el web, consiguiendo en ambos casos una gran eficiencia en 
  la utilizaci&oacute;n de grandes mundos virtuales que, adem&aacute;s, pueden 
  incluir sonido espacial tridimensional de forma que se ofrezca al usuario una 
  sensaci&oacute;n de aut&eacute;ntica inmersi&oacute;n en el mundo virtual. El 
  paradigma de programaci&oacute;n subyacente, la programaci&oacute;n orientada 
  a objetos, ofrece al dise&ntilde;ador abstracciones de alto nivel que le permiten 
  crear su escena virtual pensando en objetos geom&eacute;tricos, en vez de en 
  formas particulares (por ejemplo, tri&aacute;ngulos o cuadrados), y componi&eacute;ndolos 
  en el espacio sin necesidad de tener en cuenta la forma de optimizar el c&oacute;digo 
  para conseguir una mayor eficiencia. </p>
<p>&nbsp;</p>
<table width=750 border=0 align="center">
  <tr>
    <td colSpan=3><img align=bottom border=0 height=12 width=705
      src="/106_80514/Contenidos/rv/../imagenes/separador.gif"></td>
  </tr>
  <tr>
    <td align=middle width=250><a href="http://giga.cps.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/giga.jpg"></a></td>
    <td align=middle width=250><a href="http://add.unizar.es"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoADD.gif"></a></td>
    <td align=middle width=250><a href="http://www.unizar.es/"><img align=bottom 
      border=0 src="/106_80514/Contenidos/rv/../imagenes/logoUZ.gif"></a></td>
  </tr>
</table>

</body>


</html>
<HR>
